realsosy/InfineonRacer/2_src/InfineonRacer_TC23xA/0_Src/4_McHal/Tricore/Vadc/Adc/IfxVadc_Adc.h
/**
 * \file IfxVadc_Adc.h
 * \brief VADC ADC details
 * \ingroup IfxLld_Vadc
 *
 * \version iLLD_1_0_0_11_0
 * \copyright Copyright (c) 2013 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Vadc_Adc_Usage How to use the VADC ADC Interface driver?
 * \ingroup IfxLld_Vadc
 *
 * VADC comprises of independent analog channels with Analog/Digital converters to convert analog input to discrete digital output.
 *
 * In the following sections it will be described, how to integrate the driver into the application framework.
 *
 * \section IfxLld_Vadc_Adc_Preparation Preparation
 * \subsection IfxLld_Vadc_Adc_Include Include Files
 *
 * Include following header file into your C code:
 * \code
 *
 * #include <Vadc/Adc/IfxVadc_Adc.h>
 *
 * \endcode
 *
 * \subsection IfxLld_Vadc_Adc_Variables Variables
 * \code
 *
 * // VADC handle
 * IfxVadc_Adc vadc;
 * IfxVadc_Adc_Group adcGroup;
 * \endcode
 *
 * \subsection IfxLld_Vadc_Adc_ModuleInitialisation Module Initialisation
 * The module initialisation can be done in the same function:
 * \code
 *     // create configuration
 *     IfxVadc_Adc_Config adcConfig;
 *     IfxVadc_Adc_initModuleConfig(&adcConfig, &MODULE_VADC);
 *
 *     // initialize module
 *     // IfxVadc_Adc vadc; // declared globally
 *     IfxVadc_Adc_initModule(&vadc, &adcConfig);
 * \endcode
 *
 *
 * \subsection IfxLld_Vadc_Adc_GroupInitialisation Group Initialisation
 * The group initialisation can be done in the same function:
 * \code
 *     // create group config
 *     IfxVadc_Adc_GroupConfig adcGroupConfig;
 *     IfxVadc_Adc_initGroupConfig(&adcGroupConfig, &vadc);
 *
 *     // change group (default is GroupId_0, change to GroupId_3)
 *     adcGroupConfig.groupId = IfxVadc_GroupId_3;
 *
 *     // IMPORTANT: usually we use the same group as master!
 *     adcGroupConfig.master = adcGroupConfig.groupId;
 *
 *     // enable all arbiter request sources
 *     adcGroupConfig.arbiter.requestSlotQueueEnabled          = TRUE; // enable Queue mode
 *     adcGroupConfig.arbiter.requestSlotScanEnabled           = TRUE; // enable Scan mode
 *     adcGroupConfig.arbiter.requestSlotBackgroundScanEnabled = TRUE; // enable Background scan
 *
 *     // enable all gates in "always" mode (no edge detection)
 *     adcGroupConfig.queueRequest.triggerConfig.gatingMode          = IfxVadc_GatingMode_always;
 *     adcGroupConfig.scanRequest.triggerConfig.gatingMode           = IfxVadc_GatingMode_always;
 *     adcGroupConfig.backgroundScanRequest.triggerConfig.gatingMode = IfxVadc_GatingMode_always;
 *
 *     // enable auto scan
 *     adcGroupConfig.scanRequest.autoscanEnabled = TRUE;
 *     adcGroupConfig.backgroundScanRequest.autoBackgroundScanEnabled = TRUE;
 *
 *     // initialize the group
 *     IfxVadc_Adc_initGroup(&adcGroup, &adcGroupConfig);
 * \endcode
 *
 * \subsection IfxLld_Vadc_Adc_QueuedTransfers Queued Transfers
 * Now, VADC is initialised. Here,Three channels are used for queued transfers
 * \code
 *     // IMPORTANT: for deterministic results we have to disable the queue gate
 *     // while filling the queue, otherwise results could be output in the wrong order
 *        IfxVadc_GatingMode savedGate = IfxVadc_getQueueSlotGatingMode(adcGroup.group);
 *        IfxVadc_GatingSource gatingSource=IfxVadc_getQueueSlotGatingSource(adcGroup.group);
 *
 *        IfxVadc_setQueueSlotGatingConfig(adcGroup.group, gatingSource, IfxVadc_GatingMode_disabled );
 *     // create channel config
 *     IfxVadc_Adc_ChannelConfig adcChannelConfig[3];
 *     IfxVadc_Adc_Channel adcChannel[3];
 *
 *     for(int chnIx=0; chnIx<3; ++chnIx) {
 *         IfxVadc_Adc_initChannelConfig(&adcChannelConfig[chnIx], &adcGroup);
 *
 *         adcChannelConfig[chnIx].channelId = (IfxVadc_ChannelId)(chnIx);
 *         adcChannelConfig[chnIx].resultRegister = IfxVadc_ChannelResult_1; // use result register #1 for all channels
 *
 *         // initialize the channel
 *         IfxVadc_Adc_initChannel(&adcChannel[chnIx], &adcChannelConfig[chnIx]);
 *
 *         // Add channel to queue with refill enabled
 *         IfxVadc_Adc_addToQueue(&adcChannel[chnIx], IFXVADC_QUEUE_REFILL);
 *
 *         // restore previous gate config
 *
 *         IfxVadc_setQueueSlotGatingConfig(adcGroup.group, gatingSource, savedGate );
 *
 *         // start the Queue
 *         IfxVadc_Adc_startQueue(&adcGroup); // just for the case that somebody copy&pastes the code - the queue has already been started in previous test
 *
 *         // get 10 results for all 3 channels and store in temporary buffer
 *         // (the usage of a buffer is required, since the print statements used by the checks take more time than the conversions)
 *         Ifx_VADC_RES resultTrace[3*10];
 *         for(int i=0; i<3*10; ++i)
 *         {
 *             unsigned chnIx = i % 3;
 *
 *             // wait for valid result
 *             Ifx_VADC_RES conversionResult;
 *             do {
 *                 conversionResult = IfxVadc_Adc_getResult(&adcChannel[chnIx]);
 *             } while( !conversionResult.B.VF );
 *
 *             // store result
 *             resultTrace[i] = conversionResult;
 *         }
 *
 *         // stop the queue
 *         IfxVadc_Adc_clearQueue(&adcGroup);
 *
 *         // check results in buffer
 *  // ...
 *     }
 * \endcode
 *
 * \subsection IfxLld_Vadc_Adc_AutoScan Auto Scan
 * Autoscan of 5 channels
 * \code
 *     // create group config
 *     IfxVadc_Adc_GroupConfig adcGroupConfig;
 *     IfxVadc_Adc_initGroupConfig(&adcGroupConfig, &vadc);
 *
 *     // change group (default is GroupId_0, change to GroupId_3)
 *     adcGroupConfig.groupId = IfxVadc_GroupId_3;
 *
 *     // IMPORTANT: usually we use the same group as master!
 *     adcGroupConfig.master = adcGroupConfig.groupId;
 *
 *     // enable gate in "always" mode (no edge detection)
 *     adcGroupConfig.scanRequest.triggerConfig.gatingMode = IfxVadc_GatingMode_always;
 *
 *     // enable auto scan
 *     adcGroupConfig.arbiter.requestSlotScanEnabled = TRUE;
 *     adcGroupConfig.scanRequest.autoscanEnabled = TRUE;
 *
 *     // initialize the group
 *     //IfxVadc_Adc_Group adcGroup; // no need to create a new one
 *     IfxVadc_Adc_initGroup(&adcGroup, &adcGroupConfig);
 *
 *     {
 *         // create channel config
 *         IfxVadc_Adc_ChannelConfig adcChannelConfig[5];
 *         IfxVadc_Adc_Channel adcChannel[5];
 *
 *         for(int chnIx=0; chnIx<5; ++chnIx) {
 *             IfxVadc_Adc_initChannelConfig(&adcChannelConfig[chnIx], &adcGroup);
 *
 *             adcChannelConfig[chnIx].channelId = (IfxVadc_ChannelId)(chnIx);
 *             adcChannelConfig[chnIx].resultRegister = (IfxVadc_ChannelResult)(chnIx); // use dedicated result register
 *
 *             // initialize the channel
 *             IfxVadc_Adc_initChannel(&adcChannel[chnIx], &adcChannelConfig[chnIx]);
 *
 *             // add to scan
 *             unsigned channels = (1 << adcChannelConfig[chnIx].channelId);
 *             unsigned mask = channels;
 *             IfxVadc_Adc_setScan(&adcGroup, channels, mask);
 *         }
 *
 *         // start scan
 *         IfxVadc_Adc_startScan(&adcGroup);
 *
 *         // check results
 *         for(int chnIx=0; chnIx<5; ++chnIx) {
 *             unsigned group = adcChannel[chnIx].group->groupId;
 *             unsigned channel = adcChannel[chnIx].channel;
 *
 *             // wait for valid result
 *             Ifx_VADC_RES conversionResult;
 *             do {
 *                 conversionResult = IfxVadc_Adc_getResult(&adcChannel[chnIx]);
 *             } while( !conversionResult.B.VF );
 *
 *
 *         }
 *     }
 * \endcode
 *
 * \subsection IfxLld_Vadc_Adc_BackGroundScan Background Scan
 * Background Scan of 2 channels
 *
 * \code
 *     // create group config
 *     IfxVadc_Adc_GroupConfig adcGroupConfig;
 *     IfxVadc_Adc_initGroupConfig(&adcGroupConfig, &vadc);
 *
 *     // change group (default is GroupId_0, change to GroupId_3)
 *     adcGroupConfig.groupId = IfxVadc_GroupId_3;
 *
 *     // IMPORTANT: usually we use the same group as master!
 *     adcGroupConfig.master = adcGroupConfig.groupId;
 *
 *     // enable background scan
 *     adcGroupConfig.arbiter.requestSlotBackgroundScanEnabled  = TRUE;
 *     adcGroupConfig.backgroundScanRequest.autoBackgroundScanEnabled = TRUE;
 *
 *     // enable gate in "always" mode (no edge detection)
 *     adcGroupConfig.backgroundScanRequest.triggerConfig.gatingMode = IfxVadc_GatingMode_always;
 *
 *     // create channel config
 *     IfxVadc_Adc_ChannelConfig adcChannelConfig[2];
 *     IfxVadc_Adc_Channel adcChannel[2];
 *
 *     for(int chnIx=0; chnIx<2; ++chnIx)
 *     {
 *         IfxVadc_Adc_initChannelConfig(&adcChannelConfig[chnIx], &adcGroup);
 *
 *         adcChannelConfig[chnIx].channelId = (IfxVadc_ChannelId)(chnIx + 5);
 *         adcChannelConfig[chnIx].resultRegister = (IfxVadc_ChannelResult)(5 + chnIx); // use register #5 and 6 for results
 *         adcChannelConfig[chnIx].backgroundChannel = TRUE;
 *
 *         // initialize the channel
 *         IfxVadc_Adc_initChannel(&adcChannel[chnIx], &adcChannelConfig[chnIx]);
 *
 *         // add to background scan
 *         unsigned channels = (1 << adcChannelConfig[chnIx].channelId);
 *         unsigned mask = channels;
 *         IfxVadc_Adc_setBackgroundScan(&vadc, &adcGroup, channels, mask);
 *     }
 *
 *     // start autoscan
 *     IfxVadc_Adc_startBackgroundScan(&vadc);
 *
 *     // check results
 *     for(int chnIx=0; chnIx<2; ++chnIx)
 *     {
 *         unsigned group = adcChannel[chnIx].group->groupId;
 *         unsigned channel = adcChannel[chnIx].channel;
 *
 *         // wait for valid result
 *         Ifx_VADC_RES conversionResult;
 *         do
 *         {
 *             conversionResult = IfxVadc_Adc_getResult(&adcChannel[chnIx]);
 *         } while( !conversionResult.B.VF );
 *
 *         // check with expected value
 *  // ...
 *     }
 * \endcode
 *
 * \subsection IfxLld_Vadc_Adc_EmuxConfiguration External Multiplexer Configuration
 * External Configuration of 3 channels at channel 3
 *
 * \code
 *
 *       IfxVadc_Adc_EmuxControl emuxConfig;
 *
 *         IfxVadc_Adc_initExternalMultiplexerModeConfig(&emuxConfig,vadc);
 *
 *         emuxConfig.groupId           = IfxVadc_GroupId_1;
 *         emuxConfig.channels          = (uint8)IfxVadc_ChannelId_3;
 *         emuxConfig.startChannel   = IfxVadc_EmuxSelectValue_2; // it will take 0 to 2 external channel
 *
 *         emuxConfig.sampleTimeControl = IfxVadc_EmuxSampleTimeControl_always;
 *         emuxConfig.mode              = IfxVadc_ExternalMultiplexerMode_steady;
 *
 *         IfxVadc_Adc_EmuxPinConfig pinsConfig ={
 *  .pins={ &IfxVadc_EMUX00_P02_6_OUT,
 *          &IfxVadc_EMUX01_P02_7_OUT,
 *          &IfxVadc_EMUX02_P02_8_OUT},
 *
 *
 *         .outputMode = IfxPort_OutputMode_pushPull,
 *         .padDriver  = IfxPort_PadDriver_cmosAutomotiveSpeed1
 *  };
 *         emuxConfig.emuxOutPinConfig = pinsConfig;
 *
 *         IfxVadc_Adc_initExternalMultiplexerMode(vadc, &emuxConfig);
 *
 *         IfxVadc_setEmuxGroupResolution(&vadc->G[emuxConfig.groupId], 0, IfxVadc_ChannelResolution_12bit);
 *         IfxVadc_setEmuxGroupSampletime(&vadc->G[emuxConfig.groupId], 0, 50000, 1.0e-6);
 *
 * \endcode
 *
 * \defgroup IfxLld_Vadc_Adc Interface Driver
 * \ingroup IfxLld_Vadc
 * \defgroup IfxLld_Vadc_Adc_DataStructures Data Structures
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Module Module Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Group Group Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Channel Channel Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Background_Autoscan Background Autoscan Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_ChannelScan Channel Scan Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Queue Queue Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Clock Clock Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Interrupt Interrupt Functions
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Variables Variables
 * \ingroup IfxLld_Vadc_Adc
 * \defgroup IfxLld_Vadc_Adc_Emux Emux Functions
 * \ingroup IfxLld_Vadc_Adc
 */

#ifndef IFXVADC_ADC_H
#define IFXVADC_ADC_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

